In [2]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# Raw data file
file_to_load = "/Users/naaz.27khan/Desktop/python/panda/purchase_data.csv"

# Read purchasing file and store into pandas data frame
purchase_df = pd.read_csv(file_to_load)
purchase_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [9]:
total_players=len(purchase_df["SN"].value_counts())

576

In [36]:
player_df=pd.DataFrame({"total_players":[576]})
player_df.head()

   total_players
0            576

In [24]:
len(purchase_df["Item ID"].unique())

183

In [25]:
purchase_df["Price"].mean()

3.050987179487176

In [27]:
purchase_df["Purchase ID"].count()

780

In [28]:
purchase_df["Price"].sum()

2379.77

In [35]:
New_df=pd.DataFrame({"Number of Unique Items":[183],"Average Price":[3.05],"Number of Purchases":[780],"Total Revenue":[2379.77]
    
    
})
New_df.head()

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     183           3.05                  780        2379.77

In [50]:
num_players=purchase_df["SN"].count()
gender_demographics_totals = player_demographics["Gender"].value_counts()
gender_demographics_percents = gender_demographics_totals / num_players * 100

# Data Cleanup
gender_demographics = pd.DataFrame({"Total Count": gender_demographics_totals,
                                    "Percentage of Players": gender_demographics_percents})

gender_demographics = gender_demographics.round(2)

#Data Gender_demographics
gender_demographics

                       Total Count  Percentage of Players
Male                           652                  83.59
Female                         113                  14.49
Other / Non-Disclosed           15                   1.92

In [51]:

gender_demographics_percents

Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64

In [53]:
# Basic Calculations
gender_purchase_total = purchase_df.groupby(["Gender"]).sum()["Price"].rename("Total Purchase Value")
gender_average = purchase_df.groupby(["Gender"]).mean()["Price"].rename("Average Purchase Value")
gender_counts = purchase_df.groupby(["Gender"]).count()["Price"].rename("Purchase Count")


# Calculate normalized Purchasing
normalized_total = gender_purchase_total / gender_demographics["Total Count"]

# Cleanup
gender_data = pd.DataFrame({"Normalized Total": normalized_total, 
                            "Purchase Count": gender_counts, 
                            "Total Purchase Value": gender_purchase_total, 
                            "Average Purchase Value": gender_average})


#Display
gender_data

,Normalized Total,Purchase Count,Total Purchase Value,Average Purchase Value
Gender,,,,
Female,3.203009,113,361.94,3.203009
Male,3.017853,652,1967.64,3.017853
Other / Non-Disclosed,3.346000,15,50.19,3.346000

In [54]:
age_bins = [0, 9.90, 14.90, 19.90, 24.9, 29.9, 34.90, 39.90, 9999999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", ">40"]

#Use Cut to categorize players
player_demographics["Age Ranges"] = pd.cut(player_demographics["Age"], age_bins, labels=group_names)
player_demographics.head()

  Gender             SN  Age Age Ranges
0   Male        Lisim78   20      20-24
1   Male    Lisovynya38   40        >40
2   Male     Ithergue48   24      20-24
3   Male  Chamassasya86   24      20-24
4   Male      Iskosia90   23      20-24

In [55]:
age_demographics_totals = player_demographics["Age Ranges"].value_counts()
age_demographics_percents = age_demographics_totals / num_players * 100

age_demographics = pd.DataFrame({"Total Count": age_demographics_totals, "Percent of Players": age_demographics_percents})
age_demographics = age_demographics.sort_index()
age_demographics

       Total Count  Percent of Players
<10             23            2.948718
10-14           28            3.589744
15-19          136           17.435897
20-24          365           46.794872
25-29          101           12.948718
30-34           73            9.358974
35-39           41            5.256410
>40             13            1.666667

In [57]:
user_total = purchase_df.groupby(["SN"]).sum()["Price"].rename("Total Purchase Amount")
user_average = purchase_df.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
user_count = purchase_df.groupby(["SN"]).count()["Price"].rename("Purchase Count")

user_data = pd.DataFrame({"Total Purchase Amount": user_total,
                          "Average Purchase Price": user_average,
                          "Purchase Count": user_count})


user_data.sort_values("Total Purchase Amount", ascending=False).head(5)

             Total Purchase Amount  Average Purchase Price  Purchase Count
SN
Lisosia93                    18.96                3.792000               5
Idastidru52                  15.45                3.862500               4
Chamjask73                   13.83                4.610000               3
Iral74                       13.62                3.405000               4
Iskadarya95                  13.10                4.366667               3

In [58]:
user_total = purchase_df.groupby(["Item ID", "Item Name"]).sum()["Price"]
user_total.head()

Item ID  Item Name
0        Splinter               5.12
1        Crucifer               9.78
2        Verdict               14.88
3        Phantomlight          14.94
4        Bloodlord's Fetish     8.50
Name: Price, dtype: float64

In [60]:
purchase_total = purchase_df.groupby(["Item ID", "Item Name"]).count()["Purchase ID"]
purchase_total.head()

Item ID  Item Name
0        Splinter              4
1        Crucifer              3
2        Verdict               6
3        Phantomlight          6
4        Bloodlord's Fetish    5
Name: Purchase ID, dtype: int64

In [61]:
price_total = purchase_df.groupby(["Item ID", "Item Name"]).mean()["Price"]
price_total.head()

Item ID  Item Name
0        Splinter              1.28
1        Crucifer              3.26
2        Verdict               2.48
3        Phantomlight          2.49
4        Bloodlord's Fetish    1.70
Name: Price, dtype: float64

In [63]:
user_total = purchase_df.groupby(["Item ID", "Item Name"]).sum()["Price"].rename("Total Purchase value")
user_average = purchase_df.groupby(["Item ID", "Item Name"]).mean()["Price"].rename("Item Price")
user_count = purchase_df.groupby(["Item ID", "Item Name"]).count()["Price"].rename("Purchase Count")

user_data = pd.DataFrame({"Total Purchase value": user_total,
                          "Item Price": user_average,
                          "Purchase Count": user_count})

# Convert to Data Frame
user_data.sort_values("Total Purchase value", ascending=False).head(5)

,,Total Purchase value,Item Price,Purchase Count
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",50.76,4.23,12
82,Nirvana,44.10,4.90,9
145,Fiery Glass Crusader,41.22,4.58,9
92,Final Critic,39.04,4.88,8
103,Singed Scalpel,34.80,4.35,8